### merging columns

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
# many to one merging
dframe1 = DataFrame({'reference': ['ola','uber','lyft','gojek','grab'],'revenue':[1,2,3,4,5]})
dframe2 = DataFrame({'reference': ['ola','uber','uber','ola'],'revenue':[1,2,3,4,]})

In [3]:
dframe1

  reference  revenue
0       ola        1
1      uber        2
2      lyft        3
3     gojek        4
4      grab        5

In [4]:
dframe2

  reference  revenue
0       ola        1
1      uber        2
2      uber        3
3       ola        4

In [5]:
df3 = pd.merge(dframe1,dframe2,on='reference')
df3

  reference  revenue_x  revenue_y
0       ola          1          1
1       ola          1          4
2      uber          2          2
3      uber          2          3

In [9]:
df4 = pd.merge(dframe1,dframe2,on='reference',how='right')

In [10]:
df4

  reference  revenue_x  revenue_y
0       ola          1          1
1       ola          1          4
2      uber          2          2
3      uber          2          3

In [8]:
df5 = pd.merge(dframe1,dframe2,on='reference',how='outer')
df5

  reference  revenue_x  revenue_y
0       ola          1        1.0
1       ola          1        4.0
2      uber          2        2.0
3      uber          2        3.0
4      lyft          3        NaN
5     gojek          4        NaN
6      grab          5        NaN

In [11]:
###MANY TO MANY

In [13]:
df6 = DataFrame({'reference':['ola','ola','lyft','lyft','uber','uber','ola'],
                'revenue':[1,2,3,4,5,6,7]
                })

In [14]:
df6

  reference  revenue
0       ola        1
1       ola        2
2      lyft        3
3      lyft        4
4      uber        5
5      uber        6
6       ola        7

In [15]:
df7 = DataFrame({'reference':['uber','uber','lyft','ola','ola',],
                'revenue':[1,2,3,4,5]
                })

In [16]:
df7

  reference  revenue
0      uber        1
1      uber        2
2      lyft        3
3       ola        4
4       ola        5

In [17]:
pd.merge(df6, df7)

  reference  revenue
0      lyft        3

In [20]:
# multiple reference
df8 = DataFrame({'reference':['ola','ola','lyft'],
                'revenue':['one','two','three'],
                 'profit':[1,2,3]
                })

In [21]:
df9 = DataFrame({'reference':['ola','ola','lyft','lyft'],
                'revenue':['one','one','one','three'],
                 'profit':[4,5,6,7]
                })

In [22]:
pd.merge(df8,df9,on=['reference','revenue'],how='outer')

  reference revenue  profit_x  profit_y
0       ola     one       1.0       4.0
1       ola     one       1.0       5.0
2       ola     two       2.0       NaN
3      lyft   three       3.0       7.0
4      lyft     one       NaN       6.0

In [23]:
pd.merge(df8,df9,on=['reference','revenue'],how='outer',suffixes=('_first','_second'))

  reference revenue  profit_first  profit_second
0       ola     one           1.0            4.0
1       ola     one           1.0            5.0
2       ola     two           2.0            NaN
3      lyft   three           3.0            7.0
4      lyft     one           NaN            6.0

### merge with indexes

In [24]:
from pandas import DataFrame

In [27]:
df_1 = DataFrame({'reference':['O','U','L','O','U'],
                 'data': range(5)
                 })

In [32]:
df_2 = DataFrame({'profit':[10,20]},
                  index=['O','U'])

In [33]:
pd.merge(df_1,df_2,left_on='reference',right_index=True)

  reference  data  profit
0         O     0      10
3         O     3      10
1         U     1      20
4         U     4      20

In [34]:
df_1

  reference  data
0         O     0
1         U     1
2         L     2
3         O     3
4         U     4

In [35]:
df_2

   profit
O      10
U      20

In [42]:
df_3 = DataFrame({'ref1':['A','A','O','O','A'],
                 'ref2':[5,10,15,20,25],
                 'ref3':np.arange(5.)})

In [47]:
df_4 = DataFrame({'ref1':['A','A','O','O','O'],
                 'ref2':[15,20,25,30,35],
                 'ref3':[2,3,4,5,6]})

In [49]:
#pd.merge(df_3,df_4,left_on=['ref1','ref2'],right_index=True)

In [39]:
#join functions

In [50]:
df_3.join(df_4,lsuffix='x',rsuffix='y')

  ref1x  ref2x  ref3x ref1y  ref2y  ref3y
0     A      5    0.0     A     15      2
1     A     10    1.0     A     20      3
2     O     15    2.0     O     25      4
3     O     20    3.0     O     30      5
4     A     25    4.0     O     35      6

### concatenation - scipy

In [52]:
from numpy import random

In [53]:
B1 = np.arange(25).reshape(5,5)
A1 = random.randn(25).reshape(5,5)

In [54]:
B1

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [55]:
A1

array([[ 0.13680278,  0.09455167,  0.07654975, -0.01232811, -0.77742879],
       [ 0.08619922,  1.10602552,  0.26137734,  0.0087839 ,  1.28907053],
       [ 0.29784417, -0.9454343 , -1.15951009,  1.15394177, -1.11530377],
       [ 1.34095995,  0.12873536, -0.55568932, -0.56460004, -0.73477933],
       [-0.30025096,  0.05566456,  0.79828013, -0.70493069, -0.11716628]])

In [58]:

np.concatenate([A1,B1], axis=1)

array([[ 1.36802780e-01,  9.45516745e-02,  7.65497457e-02,
        -1.23281140e-02, -7.77428787e-01,  0.00000000e+00,
         1.00000000e+00,  2.00000000e+00,  3.00000000e+00,
         4.00000000e+00],
       [ 8.61992227e-02,  1.10602552e+00,  2.61377341e-01,
         8.78389976e-03,  1.28907053e+00,  5.00000000e+00,
         6.00000000e+00,  7.00000000e+00,  8.00000000e+00,
         9.00000000e+00],
       [ 2.97844170e-01, -9.45434301e-01, -1.15951009e+00,
         1.15394177e+00, -1.11530377e+00,  1.00000000e+01,
         1.10000000e+01,  1.20000000e+01,  1.30000000e+01,
         1.40000000e+01],
       [ 1.34095995e+00,  1.28735364e-01, -5.55689324e-01,
        -5.64600035e-01, -7.34779328e-01,  1.50000000e+01,
         1.60000000e+01,  1.70000000e+01,  1.80000000e+01,
         1.90000000e+01],
       [-3.00250962e-01,  5.56645554e-02,  7.98280125e-01,
        -7.04930694e-01, -1.17166282e-01,  2.00000000e+01,
         2.10000000e+01,  2.20000000e+01,  2.30000000e+01,
         2.40000000e+01]])

In [59]:
np.concatenate([A1,B1], axis=0)

array([[ 1.36802780e-01,  9.45516745e-02,  7.65497457e-02,
        -1.23281140e-02, -7.77428787e-01],
       [ 8.61992227e-02,  1.10602552e+00,  2.61377341e-01,
         8.78389976e-03,  1.28907053e+00],
       [ 2.97844170e-01, -9.45434301e-01, -1.15951009e+00,
         1.15394177e+00, -1.11530377e+00],
       [ 1.34095995e+00,  1.28735364e-01, -5.55689324e-01,
        -5.64600035e-01, -7.34779328e-01],
       [-3.00250962e-01,  5.56645554e-02,  7.98280125e-01,
        -7.04930694e-01, -1.17166282e-01],
       [ 0.00000000e+00,  1.00000000e+00,  2.00000000e+00,
         3.00000000e+00,  4.00000000e+00],
       [ 5.00000000e+00,  6.00000000e+00,  7.00000000e+00,
         8.00000000e+00,  9.00000000e+00],
       [ 1.00000000e+01,  1.10000000e+01,  1.20000000e+01,
         1.30000000e+01,  1.40000000e+01],
       [ 1.50000000e+01,  1.60000000e+01,  1.70000000e+01,
         1.80000000e+01,  1.90000000e+01],
       [ 2.00000000e+01,  2.10000000e+01,  2.20000000e+01,
         2.30000000e+01,  2.40000000e+01]])

In [60]:
# Series Concatenation
s1 = Series([100,200,300],index=['A','B','C'])
s2 = Series([400,500],index=['D','E'])

In [61]:
pd.concat([s1,s2])

A    100
B    200
C    300
D    400
E    500
dtype: int64

In [62]:
pd.concat([s1,s2],axis=1)

C:\Users\Acer\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       0      1
A  100.0    NaN
B  200.0    NaN
C  300.0    NaN
D    NaN  400.0
E    NaN  500.0

In [64]:
# DataFrame concatenation
df1 = DataFrame(random.randn(4,3),columns=['A','B','C'])
df2 = DataFrame(random.randn(3,3),columns=['B','D','A'])

In [65]:
pd.concat([df1,df2])

C:\Users\Acer\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         B         C         D
0  0.985293 -1.764622 -0.678354       NaN
1  2.208603  1.511235 -0.186488       NaN
2  0.793582 -0.965857  0.395793       NaN
3  0.583539 -1.021906  2.103843       NaN
0  0.189332  0.422776       NaN  0.175900
1 -0.252717 -0.032608       NaN  0.259097
2  0.051686  0.360968       NaN  1.042322

In [66]:
pd.concat([df1,df2],ignore_index=True)

C:\Users\Acer\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         B         C         D
0  0.985293 -1.764622 -0.678354       NaN
1  2.208603  1.511235 -0.186488       NaN
2  0.793582 -0.965857  0.395793       NaN
3  0.583539 -1.021906  2.103843       NaN
4  0.189332  0.422776       NaN  0.175900
5 -0.252717 -0.032608       NaN  0.259097
6  0.051686  0.360968       NaN  1.042322

In [67]:
pd.concat([df1,df2],axis=1)

          A         B         C         B         D         A
0  0.985293 -1.764622 -0.678354  0.422776  0.175900  0.189332
1  2.208603  1.511235 -0.186488 -0.032608  0.259097 -0.252717
2  0.793582 -0.965857  0.395793  0.360968  1.042322  0.051686
3  0.583539 -1.021906  2.103843       NaN       NaN       NaN

In [68]:
#url = https://pandas.pydata.org/pandas-docs/stable/generated/pandas-concat.html

### Combine pandas

In [69]:
s1 = Series([5,np.nan,6,np.nan],index=['A','B','C','D'])
s1

A    5.0
B    NaN
C    6.0
D    NaN
dtype: float64

In [70]:
s2 = Series(np.arange(4),dtype=np.float64,index=s1.index)
s2

A    0.0
B    1.0
C    2.0
D    3.0
dtype: float64

In [72]:
s3 = Series(np.where(pd.isnull(s1),s2,s1),index=s1.index)
s3

A    5.0
B    1.0
C    6.0
D    3.0
dtype: float64

In [73]:
s4 = s1.combine_first(s2)

In [74]:
s4

A    5.0
B    1.0
C    6.0
D    3.0
dtype: float64

In [75]:
#Dataframes
df_5m = DataFrame({'col1':[5,np.nan,15],
                  'col2':[20,25,np.nan],
                  'col3':[np.nan,np.nan,35]
                  })

In [76]:
df_10m = DataFrame({'col1':[0,10,20],
                   'col2':[10,20,30]
                   })

In [78]:
df_5m

   col1  col2  col3
0   5.0  20.0   NaN
1   NaN  25.0   NaN
2  15.0   NaN  35.0

In [79]:
df_10m

   col1  col2
0     0    10
1    10    20
2    20    30

In [81]:
df_5m.combine_first(df_10m)

   col1  col2  col3
0   5.0  20.0   NaN
1  10.0  25.0   NaN
2  15.0  30.0  35.0

### reshaping

In [82]:
df1 = DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['Uber','Grab'],name='cabs'),columns=pd.Index(['c1','c2','c3','c4'],name='attributes'))
df1

attributes  c1  c2  c3  c4
cabs
Uber         0   1   2   3
Grab         4   5   6   7

In [83]:
stackdf1 = df1.stack()
stackdf1

cabs  attributes
Uber  c1            0
      c2            1
      c3            2
      c4            3
Grab  c1            4
      c2            5
      c3            6
      c4            7
dtype: int32

In [84]:
df1unstack = stackdf1.unstack()
df1unstack

attributes  c1  c2  c3  c4
cabs
Uber         0   1   2   3
Grab         4   5   6   7

In [85]:
df3 = stackdf1.unstack('cabs')
df3

cabs        Uber  Grab
attributes
c1             0     4
c2             1     5
c3             2     6
c4             3     7

In [86]:
df4 = stackdf1.unstack('attributes')
df4

attributes  c1  c2  c3  c4
cabs
Uber         0   1   2   3
Grab         4   5   6   7

In [87]:
s1 = Series([5,10,15],index=['A','B','C'])
s2 = Series([15,20,25],index=['B','C','D'])

In [88]:
s3 = pd.concat([s1,s2],keys=['k1','k2'])
s3

k1  A     5
    B    10
    C    15
k2  B    15
    C    20
    D    25
dtype: int64

In [91]:
aircraft_407 = Series([0,1,2,3,4,5,6,7],index=['AMI','ANJ','FAR','FIZ','LAY','MYR','RAH','ZAH'])
aircraft_412 = Series([8,9,10,11],index=['BVK','BVL','BVM','BVN'])

In [92]:
aircraft = pd.concat([aircraft_407,aircraft_412],keys=['B407','B412'])
aircraft

B407  AMI     0
      ANJ     1
      FAR     2
      FIZ     3
      LAY     4
      MYR     5
      RAH     6
      ZAH     7
B412  BVK     8
      BVL     9
      BVM    10
      BVN    11
dtype: int64

In [93]:
aircraft1 = aircraft.unstack()
aircraft1

      AMI  ANJ  BVK  BVL   BVM   BVN  FAR  FIZ  LAY  MYR  RAH  ZAH
B407  0.0  1.0  NaN  NaN   NaN   NaN  2.0  3.0  4.0  5.0  6.0  7.0
B412  NaN  NaN  8.0  9.0  10.0  11.0  NaN  NaN  NaN  NaN  NaN  NaN

In [94]:
df = s3.unstack()
df

      A     B     C     D
k1  5.0  10.0  15.0   NaN
k2  NaN  15.0  20.0  25.0

In [95]:
df.stack()

k1  A     5.0
    B    10.0
    C    15.0
k2  B    15.0
    C    20.0
    D    25.0
dtype: float64

In [96]:
df.stack(dropna=False)

k1  A     5.0
    B    10.0
    C    15.0
    D     NaN
k2  A     NaN
    B    15.0
    C    20.0
    D    25.0
dtype: float64

### Pivot table

In [97]:
#url = 'https://en.wikipedia.org/wiki/Pivot_table'
#df_list = pd.io.html.read.html(url)
#df = df_list[0]
#df

In [98]:
#new_header = df.iloc[0] #grabthe first row for the header
#df =df[1:] #take the data less the header row
#df.columns=new_header #set the header row as the df header
#df

In [99]:
#df.pivot('Date of sale', 'Sales person', 'Total price')

### Duplicates

In [100]:
df = DataFrame({
    'col1':['uber','uber','uber','grab','grab'],
    'col2':[5,4,3,3,5]
})
df

   col1  col2
0  uber     5
1  uber     4
2  uber     3
3  grab     3
4  grab     5

In [102]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [103]:
df.drop_duplicates()

   col1  col2
0  uber     5
1  uber     4
2  uber     3
3  grab     3
4  grab     5

In [105]:
df.drop_duplicates(['col1'])

   col1  col2
0  uber     5
3  grab     3

In [108]:
df.drop_duplicates(['col1'], keep='last')

   col1  col2
2  uber     3
4  grab     5

In [109]:
df = DataFrame({'country': ['Afghanistan', 'Albania', 'Algeria'],
               'code':['93','355','213']})
df

       country code
0  Afghanistan   93
1      Albania  355
2      Algeria  213

In [110]:
GDP_map ={'Afghanistan':'20', 'Albania':'12.8', 'Algeria':'215'}
GDP_map

{'Afghanistan': '20', 'Albania': '12.8', 'Algeria': '215'}

In [111]:
df['GDP'] = df['country'].map(GDP_map)

In [112]:
df

       country code   GDP
0  Afghanistan   93    20
1      Albania  355  12.8
2      Algeria  213   215

### replace values in series

In [113]:
s1 = Series([10,20,40,50,20,10,50,40])
s1

0    10
1    20
2    40
3    50
4    20
5    10
6    50
7    40
dtype: int64

In [114]:
s1.replace(50,np.nan)

0    10.0
1    20.0
2    40.0
3     NaN
4    20.0
5    10.0
6     NaN
7    40.0
dtype: float64

In [115]:
s1.replace([10,20,50],[100,200,500])

0    100
1    200
2     40
3    500
4    200
5    100
6    500
7     40
dtype: int64

In [116]:
s1.replace({10:100,20:np.nan,40:400})

0    100.0
1      NaN
2    400.0
3     50.0
4      NaN
5    100.0
6     50.0
7    400.0
dtype: float64

### remaining indexes

In [117]:
df = DataFrame(np.arange(25).reshape(5,5),index=['UBER','OLA','GRAB','GOJEK','LYFT'],columns=['RE','LO','QU','GR','AG'])
df

       RE  LO  QU  GR  AG
UBER    0   1   2   3   4
OLA     5   6   7   8   9
GRAB   10  11  12  13  14
GOJEK  15  16  17  18  19
LYFT   20  21  22  23  24

In [119]:
#way 1 - use mapping
df.index = df.index.map(str.lower)
df

       RE  LO  QU  GR  AG
uber    0   1   2   3   4
ola     5   6   7   8   9
grab   10  11  12  13  14
gojek  15  16  17  18  19
lyft   20  21  22  23  24

In [120]:
# way 2 - rename method
df.rename(index=str.title,columns=str.lower)

       re  lo  qu  gr  ag
Uber    0   1   2   3   4
Ola     5   6   7   8   9
Grab   10  11  12  13  14
Gojek  15  16  17  18  19
Lyft   20  21  22  23  24

In [ ]:
#way 3 - using dictionary
df.rename(index={'uber':'The Best Taxi'}, columns={'RE':'Revenue'})

In [123]:
#how to save
df.rename(index={'uber':'The Best Taxi'}, columns = {'RE':'Revenue'}, inplace=True)
df

       Revenue  LO  QU  GR  AG
UBER         0   1   2   3   4
OLA          5   6   7   8   9
GRAB        10  11  12  13  14
GOJEK       15  16  17  18  19
LYFT        20  21  22  23  24

### Binining values

In [126]:
prime_nos = [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47]
number_bins = [0,10,20,30,40,50]

In [127]:
category = pd.cut(prime_nos,number_bins)
category

[(0, 10], (0, 10], (0, 10], (0, 10], (10, 20], ..., (30, 40], (30, 40], (40, 50], (40, 50], (40, 50]]
Length: 15
Categories (5, interval[int64]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] < (40, 50]]

In [128]:
category.categories

IntervalIndex([(0, 10], (10, 20], (20, 30], (30, 40], (40, 50]],
              closed='right',
              dtype='interval[int64]')

In [130]:
pd.value_counts(category)

(10, 20]    4
(0, 10]     4
(40, 50]    3
(30, 40]    2
(20, 30]    2
dtype: int64

In [131]:
# Limits
pd.cut(prime_nos,3,precision=1)

[(2.0, 17.0], (2.0, 17.0], (2.0, 17.0], (2.0, 17.0], (2.0, 17.0], ..., (17.0, 32.0], (32.0, 47.0], (32.0, 47.0], (32.0, 47.0], (32.0, 47.0]]
Length: 15
Categories (3, interval[float64]): [(2.0, 17.0] < (17.0, 32.0] < (32.0, 47.0]]

### Observation

In [132]:
df = DataFrame(np.random.randn(1000,5))
#basic observation
df.head()

          0         1         2         3         4
0  0.519011 -0.438516 -0.492677  1.299407 -0.305424
1 -0.069337 -0.501626 -0.087806 -1.997140 -0.126562
2  0.424042 -0.190880  0.098798 -0.995177 -1.994974
3 -0.909820 -1.351165  1.676830  1.040956 -0.330230
4  0.417910  1.555871 -0.003902 -0.741919 -0.149645

In [133]:
df.tail()

            0         1         2         3         4
995 -0.378514  2.440630 -0.296085  1.272065  0.742772
996 -2.118139  0.029343 -0.604341 -1.322138 -0.495886
997 -3.144844 -0.221723  0.192245 -1.777358 -0.467588
998  0.358229 -1.931715  0.730855  0.952783 -0.404045
999  0.904294  1.991144  0.403235  0.579796  1.253680

In [134]:
df.describe()

                 0            1            2            3            4
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001515     0.013767    -0.023750    -0.046500    -0.022237
std       1.007464     1.033723     0.994644     1.035346     1.008119
min      -3.144844    -3.370609    -2.938894    -3.430623    -3.464533
25%      -0.624272    -0.685827    -0.699567    -0.729582    -0.676347
50%      -0.024193     0.007968    -0.034371    -0.078812    -0.015919
75%       0.678894     0.686161     0.699013     0.663725     0.638687
max       3.392886     3.270799     2.744274     3.147154     3.572132

In [137]:
column = df[0]
column.head()

0    0.519011
1   -0.069337
2    0.424042
3   -0.909820
4    0.417910
Name: 0, dtype: float64

In [138]:
column[np.abs(column)>3]

206    3.392886
369    3.101461
580   -3.107572
997   -3.144844
Name: 0, dtype: float64

In [139]:
df[(np.abs(df)>3).any(1)]

            0         1         2         3         4
167 -0.490895 -0.327624 -2.109899  1.024583  3.572132
206  3.392886  0.940484 -0.458799  0.858678 -0.910502
208  0.998918 -1.381980 -0.604665 -3.430623  0.474942
369  3.101461 -1.436678 -0.157317 -0.686751 -1.029143
551 -1.182787 -3.318231  1.096822 -0.156542 -0.610749
580 -3.107572  0.416103  1.488989  1.199970  1.320915
714  2.075454 -0.886616  0.887621 -0.213550 -3.464533
727  0.091211  0.202767 -0.362331 -2.273825  3.466068
820 -2.320208 -0.425388  0.098494  3.147154 -1.212343
845 -0.535879 -3.370609 -0.247379  1.516621 -1.144335
868 -0.025466  3.270799 -2.760891 -1.799971 -0.478668
997 -3.144844 -0.221723  0.192245 -1.777358 -0.467588

In [140]:
df[(np.abs(df)>3)]= np.sign(df)*5

In [141]:
df.describe()

                 0            1            2            3            4
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001273     0.012185    -0.023750    -0.046216    -0.020811
std       1.036516     1.053848     0.994644     1.048962     1.026951
min      -5.000000    -5.000000    -2.938894    -5.000000    -5.000000
25%      -0.624272    -0.685827    -0.699567    -0.729582    -0.676347
50%      -0.024193     0.007968    -0.034371    -0.078812    -0.015919
75%       0.678894     0.686161     0.699013     0.663725     0.638687
max       5.000000     5.000000     2.744274     5.000000     5.000000